; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v6 - type_2 ?v4 - type_1)
 	      (pred_4 ?v7 - object ?v4 - type_1)
	      (pred_1 ?v6 - type_2 ?v3 - type_3)
	      (pred_3 ?v6 - type_2 ?v7 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v6 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_2 ?v6 ?v1))
       :effect (and  (pred_2 ?v6 ?v8)
		     (not (pred_2 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_2 ?v2 - object ?v5 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v5) (pred_2 ?v6 ?v5) (pred_1 ?v6 ?v3))
       :effect (and (pred_3 ?v6 ?v2 ?v3)
		    (not (pred_4 ?v2 ?v5)) 
		    (not (pred_1 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_2 ?v2 - object ?v5 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v2 ?v3) (pred_2 ?v6 ?v5))
       :effect (and (pred_4 ?v2 ?v5)
		    (pred_1 ?v6 ?v3)
		    (not (pred_3 ?v6 ?v2 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_2
obj_01 obj_04 - type_3
obj_09 obj_06 obj_02 - type_1
obj_07 obj_05 obj_08 - object)
(:init
(pred_2 obj_03 obj_09)
(pred_1 obj_03 obj_01)
(pred_1 obj_03 obj_04)
(pred_4 obj_07 obj_06)
(pred_4 obj_05 obj_06)
(pred_4 obj_08 obj_02)
)
(:goal
(and
(pred_4 obj_07 obj_09)
(pred_4 obj_05 obj_09)
(pred_4 obj_08 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_03 ?b obj_04))))
)
)

; plan
1. (op_1 obj_03 obj_09 obj_06)
   deleted: (pred_2 obj_03 obj_09)
   added: (pred_2 obj_03 obj_06)
   goals met: 0 of 3
2. (op_2 obj_03 obj_07 obj_06 obj_01)
   deleted: (pred_4 obj_07 obj_06) (pred_1 obj_03 obj_01)
   added: (pred_3 obj_03 obj_07 obj_01)
   goals met: 0 of 3
3. (op_1 obj_03 obj_06 obj_09)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_09)
   goals met: 0 of 3
4. (op_3 obj_03 obj_07 obj_09 obj_01)
   deleted: (pred_3 obj_03 obj_07 obj_01)
   added: (pred_4 obj_07 obj_09) (pred_1 obj_03 obj_01)
   goals met: 1 of 3
5. (op_1 obj_03 obj_09 obj_02)
   deleted: (pred_2 obj_03 obj_09)
   added: (pred_2 obj_03 obj_02)
   goals met: 1 of 3
6. (op_2 obj_03 obj_08 obj_02 obj_01)
   deleted: (pred_4 obj_08 obj_02) (pred_1 obj_03 obj_01)
   added: (pred_3 obj_03 obj_08 obj_01)
   goals met: 1 of 3
7. (op_1 obj_03 obj_02 obj_09)
   deleted: (pred_2 obj_03 obj_02)
   added: (pred_2 obj_03 obj_09)
   goals met: 1 of 3
8. (op_3 obj_03 obj_08 obj_09 obj_01)
   deleted: (pred_3 obj_03 obj_08 obj_01)
   added: (pred_4 obj_08 obj_09) (pred_1 obj_03 obj_01)
   goals met: 2 of 3
9. (op_1 obj_03 obj_09 obj_06)
   deleted: (pred_2 obj_03 obj_09)
   added: (pred_2 obj_03 obj_06)
   goals met: 2 of 3
10. (op_2 obj_03 obj_05 obj_06 obj_01)
   deleted: (pred_4 obj_05 obj_06) (pred_1 obj_03 obj_01)
   added: (pred_3 obj_03 obj_05 obj_01)
   goals met: 2 of 3
11. (op_1 obj_03 obj_06 obj_09)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_09)
   goals met: 2 of 3
12. (op_3 obj_03 obj_05 obj_09 obj_01)
   deleted: (pred_3 obj_03 obj_05 obj_01)
   added: (pred_4 obj_05 obj_09) (pred_1 obj_03 obj_01)
   goals met: 3 of 3
